; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	thermograph3 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation1 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Planet17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph3)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star16)
)
(:goal (and
	(have_image Phenomenon6 spectrograph1)
	(have_image Star7 thermograph3)
	(have_image Phenomenon8 infrared0)
	(have_image Star9 infrared0)
	(have_image Planet10 spectrograph1)
	(have_image Planet11 spectrograph2)
	(have_image Star12 infrared0)
	(have_image Phenomenon13 thermograph3)
	(have_image Phenomenon14 spectrograph2)
	(have_image Star15 thermograph3)
	(have_image Star16 infrared0)
	(have_image Planet17 infrared0)
	(have_image Star18 infrared0)
))

)

; plan
1. (turn_to satellite0 groundstation4 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 13
4. (turn_to satellite0 star7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star7)
   goals met: 0 of 13
5. (take_image satellite0 star7 instrument0 thermograph3)
   added: (have_image star7 thermograph3)
   goals met: 1 of 13
6. (turn_to satellite0 star15 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star15)
   goals met: 1 of 13
7. (take_image satellite0 star15 instrument0 thermograph3)
   added: (have_image star15 thermograph3)
   goals met: 2 of 13
8. (turn_to satellite0 planet10 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 planet10)
   goals met: 2 of 13
9. (take_image satellite0 planet10 instrument0 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 3 of 13
10. (turn_to satellite0 phenomenon6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 13
11. (take_image satellite0 phenomenon6 instrument0 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 4 of 13
12. (turn_to satellite0 phenomenon13 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 13
13. (take_image satellite0 phenomenon13 instrument0 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 5 of 13
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 13
15. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 5 of 13
16. (turn_to satellite0 groundstation1 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation1)
   goals met: 5 of 13
17. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 5 of 13
18. (turn_to satellite0 phenomenon14 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon14)
   goals met: 5 of 13
19. (take_image satellite0 phenomenon14 instrument2 spectrograph2)
   added: (have_image phenomenon14 spectrograph2)
   goals met: 6 of 13
20. (turn_to satellite0 phenomenon8 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 13
21. (take_image satellite0 phenomenon8 instrument2 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 7 of 13
22. (turn_to satellite0 planet11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet11)
   goals met: 7 of 13
23. (take_image satellite0 planet11 instrument2 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 8 of 13
24. (turn_to satellite0 planet17 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet17)
   goals met: 8 of 13
25. (take_image satellite0 planet17 instrument2 infrared0)
   added: (have_image planet17 infrared0)
   goals met: 9 of 13
26. (turn_to satellite0 star12 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star12)
   goals met: 9 of 13
27. (take_image satellite0 star12 instrument2 infrared0)
   added: (have_image star12 infrared0)
   goals met: 10 of 13
28. (turn_to satellite0 star16 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star16)
   goals met: 10 of 13
29. (take_image satellite0 star16 instrument2 infrared0)
   added: (have_image star16 infrared0)
   goals met: 11 of 13
30. (turn_to satellite0 star18 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star18)
   goals met: 11 of 13
31. (take_image satellite0 star18 instrument2 infrared0)
   added: (have_image star18 infrared0)
   goals met: 12 of 13
32. (turn_to satellite0 star9 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star9)
   goals met: 12 of 13
33. (take_image satellite0 star9 instrument2 infrared0)
   added: (have_image star9 infrared0)
   goals met: 13 of 13
